Repository: argrath/activitystreams
Catalog: omegat/omegat/project_save.tmx
Source language: en
Languages: ja

source: Every key in the object form MUST be a well-formed [BCP47] Language-Tag.
ja: オブジェクト形式の全てのキーは整形された [BCP47] Language-Tag でなければならない(MUST)。

source: Everything else in this specification is normative.
ja: この仕様におけるその他の全ては規範的である。

source: Extends:
ja: 継承:

source: Extensibility framework for other types and properties
ja: 他の型と属性のための拡張フレームワーク

source: External vocabularies can be used to express additional detail not covered by the Activity Vocabulary.
ja: 外部語彙は Activity Vocabulary で触れられていない 追加の詳細を記述するために使われる。

source: Figure 10 A note with an automatically-generated summary
ja: Figure 10 自動生成された概要を持つメモ

source: Figure 15 An Activity with a Person actor extended with VCard properties:
ja: Figure 15 VCard属性で拡張したPersonアクターのActivity:

source: Figure 16 The following example illustrates a simple Activity:
ja: Figure 16 単純なActivityを示す例:

source: Figure 17 An Activity that is both a Like and a http://schema.org/LikeAction:
ja: Figure 17 Likeとhttp://schema.org/LikeActionの両方であるActivity:

source: Figure 18 The following is a simple unordered collection:
ja: Figure 18 単純な順序のないコレクション:

source: Figure 19 The following is a simple ordered collection:
ja: Figure 19 単純な順序のあるコレクション:

source: Figure 1 Document providing a context as a string.
ja: Figure 1 コンテキストを文字列として提供している文書。

source: Figure 1 Document providing a context as a string:
ja: Figure 1 コンテキストを文字列として提供している文書:

source: Figure 20 An illustration of the relationship between Collection, OrderedCollection, CollectionPage, and OrderedCollectionPage:
ja: Figure 20 Collection, OrderedCollection, CollectionPage, OrderedCollectionPage の関係の図:

source: Figure 21 A visualization of the Collection paging model:
ja: Figure 21 Collection ページングモデルの図:

source: Figure 22 The following is a simple unordered collection with paging:
ja: Figure 22 単純な、ページング付きの順序のないコレクション:

source: Figure 23 A single name String value without language information:
ja: Figure 23 言語情報のない単一の name String 値:

source: Figure 24 Multiple, language-specific values:
ja: Figure 24 複数の、言語指定された値:

source: Figure 25 Using the "und" language tag:
ja: 図25 "und"言語タグの使用:

source: Figure 26 Specifying the default "@language" within the JSON-LD @context:
ja: Figure 26 JSON-LDの@contextの中でデフォルトの"@language"を指定する:

source: Figure 27 GeoJSON Point Coordinates:
ja: Figure 27 GeoJSONの位置座標:

source: Figure 28 The Equivalent Place alternative:
ja: Figure 28 等価なPlaceの代替物:

source: Figure 29 GeoJSON Polygon Coordinates:
ja: Figure 29 GeoJSONの多角形座標:

source: Figure 2 Document providing context as an object using the @vocab keyword and a prefix for extension terms.
ja: Figure 2 拡張用語のために @vocab キーワードと接頭辞を使ったオブジェクトで コンテキストを提供している文書。

source: Figure 2 Document providing context as an object using the @vocab keyword and a prefix for extension terms:
ja: Figure 2 拡張用語のために @vocab キーワードと接頭辞を使ったオブジェクトで コンテキストを提供している文書:

source: Figure 30 The Equivalent GeoSparql Well-Known-Text alternative:
ja: Figure 30 等価なGeoSparqlのWell-Known-Textの代替物:

source: Figure 31 A JSON-LD Compact URI definition
ja: Figure 31 あるJSON-LD Compact URI定義

source: Figure 32 A simple extended Object
ja: Figure 32 単純な、拡張されたObject

source: Figure 33 The reserialized compacted form:
ja: Figure 33 再直列化されたコンパクト化形式:

source: Figure 3 Document providing context as an array, and including an alias for an additional term.
ja: Figure 3 追加の用語のための別名を含む配列としてコンテキストを提供している文書。

source: Figure 3 Document providing context as an array, and including an alias for an additional term:
ja: Figure 3 追加の用語のための別名を含む配列としてコンテキストを提供している文書:

source: Figure 4 Expresses the statement 'http://www.test.example/martin' created 'http://example.org/foo.jpg'.
ja: Figure 4 Expresses the statement 'http://www.test.example/martin' が 'http://example.org/foo.jpg' を作ったという声明を表現する。

source: Figure 5 Expresses the statement "Martin Smith added an article to the blog 'Martin's Blog' at 3:04 PM UTC on February 10, 2015."
ja: Figure 5 「Martin Smith が2015年2月10日の午後3:04(UTC)にブログ'Martin's Blog'に 記事を追加した」ことを表現する。

source: Figure 6 A more extensive, single-entry "Activity Stream" follows:
ja: Figure 6 より広範な、単一のエントリの "Activity Stream":

source: Figure 7 Following is an example Object that uses the id and type properties to express the global identifier and object type:
ja: Figure 7 グローバルな識別子とオブジェクト型を表現するために id と type 属性を使った Object の例。

source: Figure 8 An Object that is both a Place and a gr:Location:
ja: Figure 8 Place と gr:Location の両方があるObject:

source: Figure 9 A note with a name defined by the author
ja: Figure 9 作者によって定義された名前を持つメモ

source: Fixed a typo in deleted range.
ja: deleted範囲の誤字を修正した。

source: Following are three examples of activities with varying degrees of detail.
ja: 次に、様々な詳細度を持つ三つのアクティビティの例を挙げる。

source: For example, height and width might represent the desired rendered size of a referenced image, rather than the actual pixel dimensions of the referenced image.
ja: 例えば、height と width は参照されたイメージの 実際のピクセル数ではなく、参照されたイメージが要求した 表示サイズかもしれない。

source: For example, all Objects can contain an image property whose value describes a graphical representation of the containing object.
ja: 例えば、すべてのObjectには、含まれるオブジェクトのグラフィカル表現を表すimage属性を含めることができる。

source: For example, suppose that an author wishes to send a note of thanks to another user named "@sally" with a hashtag of "#givingthanks".
ja: 例えば、作者が "@sally" という名前の他のユーザーに "#givingthanks" という タグ付きで感謝のメッセージを送りたいとする。

source: For example:
ja: 例:

source: For extensions, [JSON-LD] is used as the primary mechanism for defining and disambiguating extensions.
ja: 拡張については、拡張を定義し、明確にするための主要な機構として[JSON-LD]が使われる。

source: For instance, JSON-LD forbids "arrays of arrays" as used, for example, by the popular GeoJSON specification.
ja: 例として、JSON-LDは、例えば一般的なGeoJSON仕様で使用されている「配列の配列」を禁止している。

source: For instance, an object might be attributed to the completion of another activity.
ja: 例えば、あるオブジェクトは他のアクティビティの完了に起因するかもしれない。

source: For instance, consider the following simple Activity Stream object containing hypothetical foo and bar extension properties.
ja: 例えば次の、架空のfooとbar拡張属性を含む単純なActivity Streamを考える。

source: For instance, in the English statement, "Sally moved the file from Folder A to Folder B", the origin is "Folder A" and the target is "Folder B".
ja: 例えば、英語の文での "Sally moved the file from Folder A to Folder B" では、 origin は "Folder A" で target は "Folder B" である。

source: For instance, some vocabularies (e.g. The Good Relations Vocabulary) define their own types for describing locations.
ja: 例えば、いくつかの語彙(例えば、The Good Relations Vocabulary)は、位置を記述するための独自の型を定義する。

source: For instance, some vocabularies (e.g. VCard) define their own types for describing people.
ja: 例えば、いくつかの語彙(例えばVCard)は、人を記述するために独自の型を定義する。

source: For instance, the URI http://example.org/term can be represented as ex:term by assigning the ex: prefix the value of http://example.org/
ja: 例えば、URIhttp://example.org/termは、ex:接頭辞にhttp://example.org/の値を割り当てることで、ex:termとして表すことができる。

source: Formalizing the namespace of the base vocabulary of object types and activity types
ja: オブジェクト型とアクティビティ型の規定語彙の名前空間の形式化

source: Formally, the former example establishes an unqualified direct relationship with the image resource while the latter creates a qualified, indirect relationship that allows additional properties about the relationship to be specified.
ja: 正式には、前者の例はイメージリソースとの非修飾直接関係を確立し、後者は修飾された間接関係を作成して、関係に関する追加の属性を指定できるようにする。

source: Furthermore, while implementations are free to introduce new types of Objects beyond those defined by the Activity Vocabulary, interoperability issues can arise when applications rely too much on extension types that are not recognized by other implementations.
ja: さらに、実装はActivity Vocabularyによって定義されたものを超えた新しい型ののObjectを自由に導入することができるが、アプリケーションが他の実装によって認識されない拡張型に依存しすぎると、相互運用性の問題が発生する可能性がある。

source: HTML markup MUST NOT be included.
ja: HTML マークアップを含んでいてはならない(MUST NOT)。

source: Identifies a resource attached or related to an object that potentially requires special handling.
ja: 潜在的に特別な扱いが必要な、このオブジェクトに添付されたり 関連付けられたりしたリソースを識別する。

source: Identifies an Object that is part of the public secondary audience of this Object.
ja: このObjectのパブリックなな補助関係者の一部である一つのObjectを識別する。

source: Identifies one or more Objects that are part of the private secondary audience of this Object.
ja: このObjectのプライベートな補助関係者の一部である一つ以上のObjectを識別する。

source: Identifies one or more entities that represent the total population of entities for which the object can considered to be relevant.
ja: このオブジェクトが関連があると考えられるエントリ全体を表現する 一つ以上の実体を識別する。

source: Identifies one or more entities to which this object is attributed.
ja: このオブジェクトが起因する一つ以上の実体を識別する。

source: If a property has an array value, the absence of any items in that array MUST be represented by omitting the property entirely or by setting the value to null.
ja: 属性が配列を持つ場合、その配列に値が無い場合は、 属性全体を省略するか値に null を設定することで表現しなければならない(MUST)。

source: If no rel property is specified, the link relation is considered to be unspecified.
ja: rel属性が指定されていない場合、リンク関係は未指定と見なされる。

source: If specified, the origin indicates the context from which the object was deleted.
ja: 指定された場合、origin は object が削除した コンテキストを示す。

source: If the target property is not explicitly specified, the target would need to be determined implicitly by context.
ja: target 属性が明示的に指定されない場合、 ターゲットはコンテキストによって暗黙的に決定される必要がある。

source: If the pages of an OrderedCollection are not instances of OrderedCollectionPage, a consumer will have no reliable means of reconstructing the appropriate ordering of items.
ja: OrderedCollection のページが OrderedCollectionPage の実体でない場合、 消費者はアイテムの適切な順序を再構築するために信頼性のある手段はない。

source: If there is no name property, the summary property SHOULD NOT include markup, and SHOULD be short enough to be used as a reasonable text representation of the object.
ja: name 属性がない場合、 summary 属性はマークアップを含むべきではなく(SHOULD NOT)、 オブジェクトの妥当なテキスト表現として使われるのに 十分短いものであるべきである(SHOULD)。

source: Implementations MAY also use additional properties and values not defined in the JSON-LD @context with the understanding that any such properties will likely be unsupported and ignored by consuming implementations that use the standard JSON-LD algorithms.
ja: 実装はまた、標準の JSON-LD アルゴリズムを使う消費者実装から 無視されるであろうことを理解した上で、JSON-LD @context に定義されていない 追加の属性と値を使ってもよい(MAY)。

source: Implementations MAY augment the provided @context with additional @context definitions but MUST NOT override or change the normative context.
ja: 実装は提供された @context を追加の @context で増加させてもよい(MAY)が、 規範的なコンテキストを上書きしたり変更してはならない (MUST NOT)。

source: Implementations MAY use link relation values that are not registered.
ja: 実装は、登録されていないリンク関係値を使っても良い。(MAY)

source: Implementations MAY use the alternative URL " http://www.w3.org/ns/activitystreams" instead.
ja: 実装は代わりに代替URL "http://www.w3.org/ns/activitystreams" を 使うことができる(MAY)。

source: Implementations producing Activity Streams 2.0 documents SHOULD include a @context property with a value that includes a reference to the normative Activity Streams 2.0 JSON-LD @context definition using the URL " https://www.w3.org/ns/activitystreams".
ja: Activity Streams 2.0 文書を生成する実装は、 URL "https://www.w3.org/ns/activitystreams" を使って 標準の Activity Streams 2.0 JSON-LD @context 定義 への参照を含む値を @context 属性に 指定するべきである(SHOULD)。

source: Implementations that publish Activity Streams 2.0 documents containing extension properties SHOULD provide a @context definition for all extensions.
ja: 拡張属性を含むActivity Streams 2.0文書を公開する実装は、すべての拡張に対して@context定義を提供すべきである(SHOULD)。

source: Implementations that use JSON-LD mechanisms to parse and then reserialize Activity Streams 2.0 documents that contain extension properties SHOULD take sufficient care to ensure that extension properties used within the original document are preserved and serialized appropriately.
ja: パースにJSON-LD機構を使い、それから拡張属性を含むActivity Streams 2.0文書を再直列化する実装は、元の文書にある拡張属性が保存され、適切に直列化されるように十分な注意をするべきである(SHOULD)。

source: Implementations that wish to fully support extensions SHOULD use [JSON-LD] mechanisms.
ja: 拡張を完全にサポートしたい実装は、[JSON-LD]機構を使用すべきである。

source: Implementations that wish to reconstruct the appropriate complete ordering of member items in the logical collection should navigate to the first (or last) page in the sequence then recursively follow the next (or prev) link until all pages have been processed.
ja: 論理的なコレクションのメンバアイテムを適切で完全な順序に再構築したい実装は、 並びの最初(または最後)のページに移動して、それから全てのページを処理するまで next (または prev) リンクを再帰的に 辿るべきである。

source: In Activity Streams 2.0, an "extension" is any property, activity, actor or object type not defined by the Activity Vocabulary.
ja: Activity Streams 2.0では、「拡張」は、Activity Vocabularyによって定義されていない任意の属性、アクティビティ、アクター、またはオブジェクト型である。

source: In Activity Streams 2.0, there are essentially three ways of describing such references.
ja: Activity Streams 2.0には、このような参照を記述する方法が基本的に3種類ある。

source: In JSON-LD, Compact URI expansion of values applies to properties explicitly defined as "type": "id" in the @context definition.
ja: JSON-LDでは、valuesのCompact URI展開は@context定義の中で"type": "id"として明示的に定義された属性に適用される。

source: In addition to common properties supported by all Object instances, Activity objects support the following additional properties defined by the Vocabulary: actor | object | target | origin | result | instrument
ja: 全ての Object の実体で対応している一般的な属性に加えて、 Activity オブジェクトは Vocabulary で 定義されている次の追加の属性に対応している: actor | object | target | origin | result | instrument

source: In addition to having a global identifier (expressed as an absolute IRI using the id property) and an "object type" (expressed using the type property), all instances of the Object type share a common set of properties normatively defined by the Activity Vocabulary.
ja: (id 属性を使った絶対 IRI で記述された)グローバル修飾子と(type 属性を使って記述された)「オブジェクト型」に加えて、 Object 型の全ての実体は、 Activity Vocabulary で規定的に定義された属性の一般的な集合を共有する。

source: In addition to the base properties inherited by all Objects, all Collection types contain the additional properties: items | totalItems | first | last | current
ja: Collection 型は、 Objects から全て継承された 基底属性に加えて、追加の属性を含む: items | totalItems | first | last | current

source: In addition to the properties inherited from each of those, the OrderedCollectionPage may contain an additional startIndex property whose value indicates the relative index position of the first item contained by the page within the OrderedCollection to which the page belongs.
ja: これらから継承した属性に加えて、 OrderedCollectionPage は追加の startIndex 属性を持つ; この値は、このページが示す OrderedCollection の中で、ページに含まれている最初のアイテムの相対インデックス位置を示す。

source: In addition, all Link instances share the following common set of optional properties as normatively defined by the Activity Vocabulary: id | name | hreflang | mediaType | rel | height | width
ja: さらに、全ての Link 実体は、 Activity Vocabulary で規準的に定義されている、次のオプションの属性の一般的な集合を共有する: id | name | hreflang | mediaType | rel | height | width

source: In such cases, the items within a Collection can be divided into distinct subsets or "pages".
ja: このような場合、Collection に含まれているアイテムは 相異なる部分集合、つまり「ページ」に分割できる。

source: In the HTML5 definition, any string that does not contain the "space" U+0020, "tab" (U+0009), "LF" (U+000A), "FF" (U+000C), "CR" (U+000D) or "," (U+002C) characters can be used as a valid link relation.
ja: HTML5の定義では、「スペース」U+0020、「タブ」(U+0009)、「LF」(U+000A)、「FF」(U+000C)、「CR」(U+000D)、「,」(U+002C)文字を含まない任意の文字列を有効なリンク関係として使える。

source: In the JSON serialization, a single link relation is expressed as a single JSON string.
ja: JSON直列化では、単一のリンク関係が単一のJSON文字列として表現される。

source: In the JSON serialization, the unordered items of a Collection are represented using the items property while ordered items are represented using the orderedItems property.
ja: JSON シリアル化において、Collection の順序のないアイテムは items 属性を使って表現される一方、 順序のあるアイテムは orderedItems 属性を使って表現される。

source: In the following example, two separate references are provided.
ja: 次の例では、二つの別々の参照が提供される。

source: In the most basic sense, an "Activity" is a semantic description of an action.
ja: 最も基本的な感覚では 「アクティビティ」(Activity) は行動の意味論的な 記述である。

source: In the serialized JSON, these two forms are differentiated using a simple property naming convention, for instance: "name" identifies the JSON string form for the name property while "nameMap" represents the object form.
ja: シリアル化された JSON において、これら二つの型式は単純な属性命名規則によって 区別される; 例えば: "name" は name 属性の JSON 文字列形式を識別し、 一方 "nameMap" はオブジェクト形式を表現する。

source: In this example, both the property name term and the value ex:Foo are Compact URIs.
ja: この例では、属性名termと値ex:Fooの両方がCompact URIである。

source: Incorporation of audience targeting into the core spec
ja: 関係者指定のコア仕様への結合

source: Indicates that the actor accepts the object.
ja: actor が object を受け入れたことを示す。

source: Indicates that the actor has added the object to the target.
ja: actor が object を target に 追加したことを示す。

source: Indicates that the actor has created the object.
ja: actor が object を作成したことを示す。

source: Indicates that the actor has deleted the object.
ja: actor が object を削除したことを示す。

source: Individual items contained in such an array are independent of one another and no significance is given to the ordering.
ja: このような配列に含まれる個々の項目は互いに独立しており、順序に意味はない。

source: Inherits all properties fom IntransitiveActivity.
ja: IntransitiveActivityから全ての属性を継承する。

source: Inherits all properties from Accept.
ja: Acceptから全ての属性を継承する。

source: Inherits all properties from Activity except object.
ja: objectを除くすべての属性をActivityから継承する。

source: Inherits all properties from Activity.
ja: Activityから全ての属性を継承する。

source: Inherits all properties from Collection.
ja: Collectionから全ての属性を継承する。

source: Inherits all properties from Document.
ja: Documentから全ての属性を継承する。

source: Inherits all properties from Link.
ja: Linkから全ての属性を継承する。

source: Inherits all properties from Object.
ja: Objectから全ての属性を継承する。

source: Inherits all properties from OrderedCollection and CollectionPage.
ja: OrderedCollectionおよびCollectionPageから全てのプロパティを継承する。

source: Instances of IntransitiveActivity are a subtype of Activity representing intransitive actions.
ja: IntransitiveActivity の実体は、 自動詞的なアクションを表現するための、 Activity の派生型である。

source: Instead, publishers SHOULD make appropriate use of the vocabulary terms provided specifically for these purposes.
ja: 代わりに、発行者は それぞれの具体的にそれらの目的のために提供されている vocabulary terms を適切に使用するべきである(SHOULD)。

source: IntransitiveActivity objects are specializations of the Activity type that represent intransitive actions.
ja: IntransitiveActivity オブジェクトは、自動的なアクションを表現する Activity 型の特化である。

source: IntransitiveActivity objects do not have an object property.
ja: IntransitiveActivity オブジェクトは object 特性を持たない。

source: Introduction of the Link type for richly-described links
ja: リッチに表現されたリンクのための Link 型の導入

source: It can be used in Collections to signify that there used to be an object at this position, but it has been deleted.
ja: これは、Collection 内で、以前この位置にオブジェクトがあったが 削除されたということを示すために使われる。

source: It contains a non-empty list of space-separated URIs (the profile URIs).
ja: これは空白で区切られた URI (プロファイル URI) の空でないリストである。

source: It forms part of the [SWP] suite of related standards.
ja: これは [SWP] スイートの一部を形成する。

source: It is a stable document and may be used as reference material or cited from another document.
ja: これは安定した文書であり、参考資料として使用したり、他の文書から引用したりすることができる。

source: It is also important to note that there are valid JSON constructs which cannot be used within a JSON-LD document.
ja: また、JSON-LD文書内では使用できない、妥当なJSON構造体があることに注意することも重要である。

source: It is important to note that the Activity type itself does not carry any specific semantics about the kind of action being taken.
ja: Activity 型自身は取られるアクションの種類について 何の特定の意味も持たないことに注意することは重要である。

source: It is important to note that the JSON-LD Processing Algorithms [ JSON-LD-API], as currently defined, will silently ignore any property not defined in a JSON-LD @context.
ja: JSON-LD Processing Algorithms[JSON-LD-API]は、現在定義されているように、JSON-LD @contextで定義されていない属性を暗黙に無視することに注意することは重要である。

source: It is important to note that the `time-offset` component does not correlate to time-zones, and while times that include the `time-offset` component work well for timestamps, they cannot be reliably converted to and from local "wall times" without additional information and processing.
ja: `time-offset` 要素はタイムゾーンとは関係なく、 `time-offset` 要素を含む時刻はタイムスタンプとして上手く動作するが、 追加の情報と処理なしにこれとローカルの「壁時計時間」とを確実に変換することは できないということに注意することは重要である。

source: It is intended to be used in the context of the ActivityStreams 2.0 format and provides a foundational vocabulary for activity structures, and specific activity types.
ja: これは ActivityStreams 2.0 形式の文脈で使われることを意図しており、 アクティビティ構造のための基礎的な語彙と特定のアクティビティ型を提供する。

source: It is intended to be used with vocabularies that detail the structure of activities, and define specific types of activities.
ja: これは、アクティビティの構造を詳細に記述し、特定の型のアクティビティを定義する語彙とともに使うを目的とする。

source: It is the goal of this specification to provide a JSON-based syntax that is sufficient to express metadata about activities in a rich, human-friendly but machine-processable and extensible manner.
ja: この仕様のゴールは、アクティビティについて、 リッチで人間に優しいけれども、機械で処理可能かつ拡張可能な形で メタデータを記述するのに十分な JSON ベースの文法を提供することである。

source: It ought to be noted that the [HTML5] specification provides its own alternative definition of a "link relation" that differs slightly from the [RFC5988] definition.
ja: [HTML5]仕様は、[RFC5988]定義とわずかに異なる「リンク関係」の独自の代替定義を提供していることに注意すべきである。

source: JSON-LD uses the special @context property to define the processing context.
ja: JSON-LD は processing context を 定義するために特別な @context 属性を使う。

source: Many of the properties defined by the Activity Vocabulary allow values that are either instances of Object or Link.
ja: Activity Vocabulary で定義されている多くの属性は、 Object または Link のどちらの 実体を値に取ることもできる。

source: Method
ja: 手法

source: Most implementations would also send a special notification to sally letting her know that a note mentioning her has been created.
ja: ほとんどの実装はまた、自分が作ったメッセージが言及されたことを知らせるために、 sally に特別な通知を送信する。

source: Multi-lingual representation of activities
ja: アクティビティの多言語表現

source: Multiple link relations are expressed as an array of JSON strings.
ja: 複数のリンク関係は、JSON文字列の配列として表現される。

source: Natural language values within an Activity Streams 2.0 document MAY contain bidirectional text.
ja: Activity Streams 2.0文書内の自然言語値は、双方向テキストを含んでもよい(MAY)。

source: No additional detail is given:
ja: 追加の詳細はなし:

source: Not all examples in this specification explicitly mark the language of natural language properties.
ja: この仕様のすべての例が、自然言語属性の言語を明示的に示しているわけではない。

source: Note that support for extensions can vary across implementations and no normative processing model for extensions is defined.
ja: 拡張の対応は実装によって異なる可能性があり、拡張の標準的な処理モデルは定義されていないことに注意すること。

source: Note that the Link and Object types are disjoint from one another.
ja: Link型とObject型は排他であることに注意すること。

source: Note that while the Activity Streams 2.0 format uses JSON-LD conventions, there are a number of constraints and additional requirements for Activity Streams 2.0 implementations that justify the use of a specific media type.
ja: Activity Streams 2.0 型式は JSON-LD 仕様を使う一方、 この特定のメディアタイプの使用を正当化する Activity Streams 2.0 実装のためには、多くの制限と追加の要求があることに 注意すること。

source: Note: While this appendix sections is non-normative, it uses normative terms such as MUST.
ja: 注意: この付録は非規範的であるが、MUSTのような規範的用語を使う。

source: Notes:
ja: 説明:

source: Often, it becomes impractical for an implementation to serialize every item contained by a Collection using the items (or orderedItems) property alone.
ja: しばしば、 items (または orderedItems) 属性だけを使って Collection に含まれている全てのアイテムをシリアル化するのは 実装上非実用的になる。

source: Other documents may supersede this document.
ja: 他の文書がこの文書に取って代わることがある。

source: Over reliance on the Compact URI form can lead to ambiguity and interoperability issues between implementations.
ja: Compact URI形式に過度に依存することは、実装間の曖昧さと相互運用性の問題を引き起こす可能性がある。

source: Please contact the GitHub repository regarding this document.
ja: この文書に関する連絡はGitHubリポジトリにお願いします。
